--------------------------------------------------------------------------------
-- ПОДСИСТЕМА АРХИВИРОВАНИЯ ИЗМЕНЕННЫХ/УДАЛЕННЫХ ДАННЫХ
-- ДЛЯ СУБД FIREBIRD SQL SERVER 2.0
-- (С) Copyright, Александр Ситников, Благовещенск, 2007
--------------------------------------------------------------------------------

-- ПРЕДВАРИТЕЛЬНАЯ ИНИЦИАЛИЗАЦИЯ БД

DECLARE EXTERNAL FUNCTION RTRIM
    CSTRING(4096)
RETURNS CSTRING(4096) FREE_IT
ENTRY_POINT 'IB_UDF_rtrim' MODULE_NAME 'ib_udf';

COMMENT ON EXTERNAL FUNCTION RTRIM
IS 'Функция для обрезки пробелов в строке справа';

------------
------------
------------
------------
------------


